## Pandas-tehtävät

#### Huom: Koko harjoituksen ajan on tarkoitus käsitellä alkuperäistä dataframea!

#### Tehtävä 1. Lisää tarvittavat kirjastot ja lue `testidata.csv` niminen tiedosto DataFrame-objektiin

In [1]:
#pandas- ja numpy-kirjastojen lisääminen
import pandas as pd
import numpy as np

In [2]:
#csv-tiedoston lukeminen
testidata = pd.read_csv("testidata.csv")

#### Tehtävä 2. Tulosta DataFrame-objektin viisi viimeistä riviä

In [3]:
#Tulostetaan tail():llä viimeiset rivit. Oletusarvo on 5.
testidata.tail()

    Unnamed: 0   sarake1   sarake2   sarake3
20          20  0.300589  0.455980  0.292225
21          21  0.859970  0.346539  0.364629
22          22  0.842364  0.093485  0.662066
23          23  0.781693  0.573344  0.815692
24          24  0.788949  0.945625  0.852690

#### Tehtävä 3. Tulosta datan sarakkeiden otsikot list-objektina

In [4]:
#Tulostetaan list():llä sarakkeiden otsikot 
otsikot = list(testidata)
otsikot

['Unnamed: 0', 'sarake1', 'sarake2', 'sarake3']

#### Tehtävä 4. Tulosta `sarake2`:n pituus (sarakkeessa olevien elementtien määrä)

In [5]:
#Käytetään len():iä sarakkeen pituuden laskemiseen
sarake2_pituus = len(testidata["sarake2"])
sarake2_pituus

25

#### Tehtävä 5. Tulosta datan ensimmäisen rivin tiedot

In [6]:
#Käytetään iloc:ia rivin valitsemiseen
eka_rivi = testidata.iloc[0]
eka_rivi

Unnamed: 0    0.000000
sarake1       0.319219
sarake2       0.380058
sarake3       0.919389
Name: 0, dtype: float64

#### Tehtävä 6. Pudota datasta  `Unnamed: 0` niminen sarake ja todenna lopputulos valitsemallasi tavalla

In [7]:
#Pudotetaan drop():lla sarake pois. axis=1 viittaa sarakkeeseen
testidata.drop(["Unnamed: 0"], inplace=True,axis=1)
testidata.head(3)

    sarake1   sarake2   sarake3
0  0.319219  0.380058  0.919389
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745

#### Tehtävä 7. Poista rivit, jos sarakkeessa `sarake1` esiintyy arvo 0.2 tai pienempi

In [8]:
#Käytetään loc:ia rivien valintaan
testidata = testidata.loc[testidata["sarake1"] > 0.2]
testidata

     sarake1   sarake2   sarake3
0   0.319219  0.380058  0.919389
1   0.922251  0.490721  0.133932
3   0.363707  0.878349  0.485700
6   0.323134  0.036466  0.186775
7   0.467610  0.850993  0.377558
8   0.303299  0.096971  0.451031
9   0.733485  0.591996  0.658924
10  0.641628  0.251886  0.274987
12  0.319906  0.489200  0.990319
13  0.780267  0.458454  0.053428
15  0.935875  0.698276  0.446885
17  0.273193  0.300307  0.768270
18  0.467060  0.225161  0.911570
20  0.300589  0.455980  0.292225
21  0.859970  0.346539  0.364629
22  0.842364  0.093485  0.662066
23  0.781693  0.573344  0.815692
24  0.788949  0.945625  0.852690

#### Tehtävä 8. Tulosta `sarake1` sarakkeen minimi- ja maksimiarvo

In [9]:
#Tulostetaan maksimiarvo max():lla ja minimiarvo min():lla
max_arvo = testidata["sarake1"].max()
min_arvo = testidata["sarake1"].min()
print(f"Maksimiarvo on {max_arvo} ja minimiarvo on {min_arvo}")

Maksimiarvo on 0.9358745961778226 ja minimiarvo on 0.2731929006731526

#### Tehtävä 9. Tee ensimmäisen rivin ensimmäisen sarakkeen arvosta nan

In [10]:
#Käytetään iloc:ia määritetyn arvon valintaan ja numpyn avulla tehdään arvosta nan
testidata.iloc[0,0] = np.nan
testidata

     sarake1   sarake2   sarake3
0        NaN  0.380058  0.919389
1   0.922251  0.490721  0.133932
3   0.363707  0.878349  0.485700
6   0.323134  0.036466  0.186775
7   0.467610  0.850993  0.377558
8   0.303299  0.096971  0.451031
9   0.733485  0.591996  0.658924
10  0.641628  0.251886  0.274987
12  0.319906  0.489200  0.990319
13  0.780267  0.458454  0.053428
15  0.935875  0.698276  0.446885
17  0.273193  0.300307  0.768270
18  0.467060  0.225161  0.911570
20  0.300589  0.455980  0.292225
21  0.859970  0.346539  0.364629
22  0.842364  0.093485  0.662066
23  0.781693  0.573344  0.815692
24  0.788949  0.945625  0.852690

#### Tehtävä 10. Tallenna lopputulos data_export.csv-nimiseen tiedostoon (tiedostoa hyödynnetään seuraavassa harjoituksessa).

In [12]:
#Käytetään to_csv():tä tallentamiseen.
testidata.to_csv("data_export.csv")